Public Attributes | List of all members
API_ObjectType Struct Reference
Element Manager
Represents an object or a lamp, or a symbol label. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | pen
Pen attribute index.
 API_AttributeIndex  | ltypeInd
Line type attribute index.
 API_AttributeIndex  | mat
Material attribute index.
 API_AttributeIndex  | sectFill
Section fill attribute index.
 short  | sectFillPen
Section fill pen attribute index.
 short  | sectBGPen
Section fill background pen attribute index.
 short  | sectContPen
Section fill contour pen attribute index.
 bool  | useObjPens
Use the pens defined in the library part?
 bool  | useObjLtypes
Use the line types defined in the library part.
 bool  | useObjMaterials
Use the materials defined in the library part.
 bool  | reflected
Is the symbol reflected?
 bool  | useXYFixSize
Use the A and B values as fixed sizes?
 bool  | useObjSectAttrs
Use the section attributes defined in the library part?
 short  | fixPoint
The index-1 of hotspot to keep fixed.
 double  | angle
The rotation angle (radian).
 double  | level
The base height from the floor level.
 double  | xRatio
The ratio of the size of the placed object/lamp in the X direction and the A value defined in the library part (multiplication factor in X direction).
 double  | yRatio
The ratio of the size of the placed object/lamp in the Y direction and the B value defined in the library part (multiplication factor in Y direction).
 API_Coord  | offset
Offset of the symbol's origin from insertion point.
 Int32  | fixedAngle
Use fix angle.
 API_RGBColor  | lightColor
Color of the light (for lamps only).
 API_StoryVisibility  | visibility
Visibility information of the object/lamp.
 API_LinkToSettings  | linkToSettings
Mode of linking to home story.
 bool  | lightIsOn
The light is on/off.
 bool  | isAutoOnStoryVisibility
Recalculate the story visibility automatically according to the actual vertical extent of the object ("All Relevant Stories").
 API_ElemType  | ownerType
Type of the owner (external object).
 API_Guid  | owner
Index of the owner element of the object.
 Int32  | libInd
Index to the symbol in the library.
 API_Coord  | pos
Position of the origin of the object.
 GS::Int64  | lookId
Same number for similar-looking objects/lamps 2D draw.
Detailed Description
Represents an object or a lamp, or a symbol label.
Since
Archicad 26
Remarks
For beam related memo data see the ACAPI_Element_GetMemo function. From version 26 the type of the ownerID member was changed to API_ElemType.
See also
API_LampType